#include <iostream>#include <cstring>//Новогодняя гирлянда состоит из нескольких последовательно соединенных разноцветных лам- почек, причем цвет каждой лампочки не меняется. Участок гирлянды считается красивым, если все лампочки этого участка имеют разные цвета. Определите максимальное количество последователь- ных лампочек, образующих красивый участок./*Формат входных данныхВ первой и единственной строке непустая последовательность из строчных латинских букв, определяющая последовательность цветов лампочек в гирлянде. Одинаковым буквам в этой по- следовательности соответствуют одинаковые цвета лампочек, а разным – разные. Длина строки не превышает 106 символов.Формат выходных данныхЦелое положительное число – максимальное количество последовательных лампочек, все цвета которых различны. */int main() {    char str[1000000];    size_t i = 0;    std::cin >> str;    i = strlen(str);    char c;    int max = 1;    int y;    for (int j = 0; j < i - 1; j++) {        for (int k = j + 1; k < i; k++) {            c = str[k];            for (y = j; y < k; y++) {                if (str[y] == c) {                    break;                }            }            if (y == k) {                if (max < (y - j + 1)) {                    max = y - j + 1;                }            }            else {                break;            }        }    }    std::cout << max << std::endl;    return 0;}    